
## Plan Result (stg/resources)

[CI link](https://github.com/tooruuetani/github-actions-trial/actions/runs/4081816085)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_codecommit_repository.main


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_codecommit_repository.main will be created
  + resource "aws_codecommit_repository" "main" {
      + arn             = (known after apply)
      + clone_url_http  = (known after apply)
      + clone_url_ssh   = (known after apply)
      + description     = "Dummy repository."
      + id              = (known after apply)
      + repository_id   = (known after apply)
      + repository_name = "Dummy"
      + tags_all        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy-resource-for-stg","PRNumber":8,"Program":"tfcmt","SHA1":"da369f6a3b505c4a6adf68b8b42872acf5a1687a","Target":"stg/resources","Vars":{},"WorkflowName":"Deploy resources to dev environment."} -->